#+TITLE: Website-related items and notes
#+STARTUP: show2levels

* Working space / random links
- http://bettermotherfuckingwebsite.com/
- https://retrolog.io/blog/creating-a-hugo-theme-from-scratch/
  
** On sidenotes
- https://www.inkandswitch.com/local-first.html#git

** On main page
- https://themes.gohugo.io/theme/academic/
- https://stackoverflow.com/questions/4538447/how-to-create-two-columns-on-a-web-page
- 

* Current project TODOs
** TODO Update the "Teaching" section
[2024-06-10 Mo 10:57]

(add supervision)
** TODO Update the CV (master + public)
[2024-06-10 Mo 10:56]

** DONE fix the link to =MATH8100_Project= repo 
CLOSED: [2022-04-21 Thu 14:03]
- State "DONE"       from "TODO"       [2022-04-21 Thu 14:03]
:LOGBOOK:
CLOCK: [2022-04-21 Thu 13:58]--[2022-04-21 Thu 14:03] =>  0:05
:END:
[2022-03-24 Thu 15:40]
[[file:~/projects/bochkarev.io/content-org/notes/stack.org::- For a high-performance code, besides Julia, I would go with C++ or Java. (My last experience involved implementing \[\[https://en.wikipedia.org/wiki/Ellipsoid_method\]\[Ellipsoid method\]\] for LPs as a \[\[https://github.com/alex-bochkarev/MATH8100_Project\]\[course project\]\].)]]

(this underscore doesn't work with GitHub, as usual...)
** DONE Add code docs for align-BDD
CLOSED: [2022-04-21 Thu 14:28]
- State "DONE"       from "TODO"       [2022-04-21 Thu 14:28]
:LOGBOOK:
CLOCK: [2022-04-21 Thu 14:00]--[2022-04-21 Thu 14:28] =>  0:28
:END:
** DONE fix CSS for local links
CLOSED: [2022-08-18 Thu 21:32]
- State "DONE"       from "TODO"       [2022-08-18 Thu 21:32]
:LOGBOOK:
CLOCK: [2022-08-18 Thu 21:25]--[2022-08-18 Thu 21:32] =>  0:07
:END:
** TODO Add a dissertation presentation
** TODO Add Aachen presentation when ready.
** TODO revise image cards
- [ ] crop / adjust the image for twitter cards
- [ ] add OpenGraph
- [ ] maybe add schema.org here?
** TODO Add a note on JavaScript in =privacy.md=
SCHEDULED: <2022-05-04 Wed>
** TODO Think about metadata / schema.org / microformats?
How to make pages machine-readable by search engines and (possibly) custom bots?
Also, improves sharing, etc. Seen a note on this in Xiaoxing's notes (see [[file:../../zettelkasten/20201003093034-blogs.org][🕮:blogs]]) 

** TODO fix the gap between the footer and the content (on some pages)
 [2021-09-18 Sat 22:54]
** TODO Maybe revise and publish my "mega-config" repo?..
 [2021-09-18 Sat 22:36]
** TODO Think: maybe pack into a tangled =.org= file?
- at least the =CSS= file...
- but also page structure seems interesting?.. would it be worth the hassle, though?
** TODO Incorporate QR code into contacts?
   Add vCard?
** TODO remove =short= tag
(was used in Jekyll to affect the summary view. Not needed anymore)

** TODO Create GPG page 
 [2020-11-13 Fri 09:38]
- the necessary keys are there already.
- see links to notes at https://oscarnajera.com/cv/
** TODO Sidenotes and a shortcode for that. :someday:
 [2020-11-13 Fri 09:38]
 https://danilafe.com/blog/sidenotes/
** TODO Metapost
 [2020-11-13 Fri 09:40]
** TODO Implement the =pi= button :)
 [2020-11-13 Fri 10:33]
** TODO correct =svg= icons / single vs. multiple files
** TODO Correct local links in posts
(dirname issue)
** TODO Add RSS/Atom feed!
** TODO Migrate =biosnippets= repo, maybe?
   seems slightly better, I guess, for snippets...
** TODO Add legend to the meta-post.
** TODO Review site accessibility
 [2020-11-10 Tue 22:49]

 Especially footer and header.
** TODO Add dotplot picture
** TODO Add SMTB-Algo picture
** TODO Add all twitter-cards (all posts)
** TODO Make a shortcode for svg-icon!
 [2021-01-14 Thu 12:08]
 
** TODO Add 1- or 0.5-line space after the footer
** Documentation
*** front-matter parameters
    - icons
    - hidetoc
    - image (twitter-card)
** TODO Fix =li= elements
 [2021-02-05 Fri 20:44]

 (so I don't need double newlines after a sub-list)
** TODO Fix org-babel blocks =RESULTS= CSS 
 [2021-02-05 Fri 21:03]
Add some styling
** TODO Add a blinking cursor?
 [2021-02-06 Sat 23:50]
